Repository: dlunna/al.dj.p4u
Catalog: project/core/locale/*/LC_MESSAGES/django.po
Languages: es

source: Home
es: Inicio

source: About
es: Acerca de

source: Governor´s message
es: Mensaje del Gobernador

source: What is ELE?
es: ¿Que es ELE?

source: Components
es: Componentes

source: Methodology
es: Metología

source: Partners
es: Socios

source: Learning
es: Aprendiendo

source: Level A1
es: Nivel A1

source: Level A2
es: Nivel A2

source: Level B1
es: Nivel B1

source: Level B1+
es: Nivel B1+

source: Teaching
es: Enseñando

source: Resources & Assessment
es: Recursos y evaluación

source: Digital Tools
es: Herramientas digitales

source: Practice
es: Práctica

source: Strategy components ELE
es: Componentes de la estrategia ELE

source: The G4U strategy includes the following components:
es: La estrategia G4U incluye los siguientes componentes:

source: Governor’s message
es: Mensaje del Gobernador

source: methodology-parrafo0
es: Todo el material desarrollado se encuentra alineado al Marco Común Europeo de Referencia de Lengua (MCERL) dado que es el marco utilizado por todas las Instituciones de Educación Superior para la enseñanza del idioma inglés, mismo que considera 5 niveles de dominio.

source: methodology-parrafo1
es: Cada nivel de dominio considera dos materiales principales: Student's Book y Workbook

source: methodology-parrafo2
es: Student's Book es material de aprendizaje mediado por el docente y WorkBook es material de aprendizaje independiente.

source: methodology-parrafo3
es: Existe un Students Book y un Workbook por cada uno de los niveles de dominio del MCERL, integrados por 10 unidades de aprendizaje que se componen por 5 lecciones cada una, asegurando a través de sus ejercicios, la integración de las competencias básicas del idioma: Reading, Writing, Listening y Speaking.
